0x900C5649/nrf52_boards/source/crypto.c
// Copyright 2019 SoloKeys Developers
//
// Licensed under the Apache License, Version 2.0, <LICENSE-APACHE or
// http://apache.org/licenses/LICENSE-2.0> or the MIT license <LICENSE-MIT or
// http://opensource.org/licenses/MIT>, at your option. This file may not be
// copied, modified, or distributed except according to those terms.
/*
 *  Wrapper for crypto implementation on device.
 *
 *  Can be replaced with different crypto implementation by
 *  defining EXTERNAL_SOLO_CRYPTO
 *
 * */
#ifndef EXTERNAL_SOLO_CRYPTO

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "util.h"
#include "crypto.h"

//#include "sha256.h"
#include "uECC.h"
#include "aes.h"
#include "ctap.h"
#include "device.h"
// stuff for SHA512
//#include "sha2.h"
#include "blockwise.h"
#include APP_CONFIG
#include "log.h"

// SDK headers
#include "nrf_crypto.h"
#include "nrf_crypto_aes.h"
#include "nrf_crypto_error.h"

typedef enum
{
    MBEDTLS_ECP_DP_NONE = 0,
    MBEDTLS_ECP_DP_SECP192R1,      /*!< 192-bits NIST curve  */
    MBEDTLS_ECP_DP_SECP224R1,      /*!< 224-bits NIST curve  */
    MBEDTLS_ECP_DP_SECP256R1,      /*!< 256-bits NIST curve  */
    MBEDTLS_ECP_DP_SECP384R1,      /*!< 384-bits NIST curve  */
    MBEDTLS_ECP_DP_SECP521R1,      /*!< 521-bits NIST curve  */
    MBEDTLS_ECP_DP_BP256R1,        /*!< 256-bits Brainpool curve */
    MBEDTLS_ECP_DP_BP384R1,        /*!< 384-bits Brainpool curve */
    MBEDTLS_ECP_DP_BP512R1,        /*!< 512-bits Brainpool curve */
    MBEDTLS_ECP_DP_CURVE25519,           /*!< Curve25519               */
    MBEDTLS_ECP_DP_SECP192K1,      /*!< 192-bits "Koblitz" curve */
    MBEDTLS_ECP_DP_SECP224K1,      /*!< 224-bits "Koblitz" curve */
    MBEDTLS_ECP_DP_SECP256K1,      /*!< 256-bits "Koblitz" curve */
} mbedtls_ecp_group_id;

//ret values
static ret_code_t                           err_code;

//hash ctxs
static nrf_crypto_hash_context_t            sha256_ctx;
static nrf_crypto_hash_context_t            sha512_ctx;

//hmac ctx
static nrf_crypto_hmac_context_t            hmac_ctx;

//ecc ctx
static const struct uECC_Curve_t * _es256_curve = NULL;
static const uint8_t * _signing_key = NULL;
static int _key_len = 0;

//aes ctx
static nrf_crypto_aes_context_t             aes_ctx;


// Secrets for testing only
static uint8_t master_secret[64];
static uint8_t transport_secret[32];

// useful consts
uint8_t NULLS[32];

void crypto_init(void)
{
    // Initialize nrf_crypto
    memset(NULLS, 0, 32);
    err_code = nrf_crypto_init();
    VERIFY_SUCCESS(err_code);
}

void crypto_sha256_init(void)
{
    err_code = nrf_crypto_hash_init(&sha256_ctx, &g_nrf_crypto_hash_sha256_info);
    APP_ERROR_CHECK(err_code);
    //sha256_init(&sha256_ctx);
}

void crypto_sha512_init(void)
{
    err_code = nrf_crypto_hash_init(&sha256_ctx, &g_nrf_crypto_hash_sha512_info);
    APP_ERROR_CHECK(err_code);
    //cf_sha512_init(&sha512_ctx);
}

void crypto_load_master_secret(uint8_t * key)
{
#if KEY_SPACE_BYTES < 96
#error "need more key bytes"
#endif
    memmove(master_secret, key, 64);
    memmove(transport_secret, key+64, 32);
}

void crypto_reset_master_secret(void)
{
    memset(master_secret, 0, 64);
    memset(transport_secret, 0, 32);
    ctap_generate_rng(master_secret, 64);
    ctap_generate_rng(transport_secret, 32);
}

void crypto_sha256_update(uint8_t * data, size_t len)
{
    //sha256_update(&sha256_ctx, data, len);
    err_code = nrf_crypto_hash_update(&sha256_ctx, data, len);
    APP_ERROR_CHECK(err_code);
}

void crypto_sha512_update(const uint8_t * data, size_t len) {
    //cf_sha512_update(&sha512_ctx, data, len);
    err_code = nrf_crypto_hash_update(&sha512_ctx, data, len);
    APP_ERROR_CHECK(err_code);
}

void crypto_sha256_update_secret()
{
    //sha256_update(&sha256_ctx, master_secret, 32);
    err_code = nrf_crypto_hash_update(&sha256_ctx, master_secret, 32);
    APP_ERROR_CHECK(err_code);
}

void crypto_sha256_final(uint8_t * hash)
{
    uint32_t digest_size = NRF_CRYPTO_HASH_SIZE_SHA256;
    //sha256_final(&sha256_ctx, hash);
    err_code = nrf_crypto_hash_finalize(&sha256_ctx, hash, &digest_size);
    APP_ERROR_CHECK(err_code);
//    memset(&sha256_ctx,0, sizeof(sha256_ctx)); //empty hash context to prevent double use
}

void crypto_sha512_final(uint8_t * hash)
{
    uint32_t digest_size = NRF_CRYPTO_HASH_SIZE_SHA512;
    err_code = nrf_crypto_hash_finalize(&sha512_ctx, hash, &digest_size);
    APP_ERROR_CHECK(err_code);
    // NB: there is also cf_sha512_digest
    //cf_sha512_digest_final(&sha512_ctx, hash);
}

void crypto_sha256_hmac_init(uint8_t * key, uint32_t klen)
{
    uint8_t buf[64];
    unsigned int i;
    memset(buf, 0, sizeof(buf));

    if (key == CRYPTO_MASTER_KEY)
    {
        key = master_secret;
        klen = sizeof(master_secret)/2;
    }
    else if (key == CRYPTO_TRANSPORT_KEY)
    {
        key = transport_secret;
        klen = 32;
    }

    if(klen > 64)
    {
        printf2(TAG_ERR, "Error, key size must be <= 64\n");
        exit(1);
    }

    //memmove(buf, key, klen);

    //for (i = 0; i < sizeof(buf); i++)
    //{
    //    buf[i] = buf[i] ^ 0x36;
    //}

    err_code = nrf_crypto_hmac_init(&hmac_ctx,
                                    &g_nrf_crypto_hmac_sha256_info,
                                    key,
                                    klen
                                    );
    APP_ERROR_CHECK(err_code);


    //crypto_sha256_init();
    //crypto_sha256_update(buf, 64);
}

void crypto_sha256_hmac_update(const uint8_t * data, size_t len)
{
    err_code = nrf_crypto_hmac_update(&hmac_ctx,
                                        data,
                                        len
                                        );
    APP_ERROR_CHECK(err_code);
}

void crypto_sha256_hmac_final(uint8_t * hmac, size_t * len)
{
    err_code = nrf_crypto_hmac_finalize(&hmac_ctx,
                                        hmac,
                                        len
                                        );
    APP_ERROR_CHECK(err_code);
}


void crypto_ecc256_init(void)
{
    uECC_set_rng((uECC_RNG_Function)ctap_generate_rng);
    _es256_curve = uECC_secp256r1();
}


void crypto_ecc256_load_attestation_key(void)
{
    _signing_key = device_get_attestation_key();
    _key_len = 32;
}

void crypto_ecc256_sign(uint8_t * data, int len, uint8_t * sig)
{
    if ( uECC_sign(_signing_key, data, len, sig, _es256_curve) == 0)
    {
        printf2(TAG_ERR, "error, uECC failed\n");
        exit(1);
    }
}

void crypto_ecc256_load_key(uint8_t * data, int len, uint8_t * data2, int len2)
{
    size_t keylen = 32;
    static uint8_t privkey[32];
    generate_private_key(data,len,data2,len2,privkey, &keylen);
    _signing_key = privkey;
    _key_len = 32;
}

void crypto_ecdsa_sign(uint8_t * data, int len, uint8_t * sig, int MBEDTLS_ECP_ID)
{

    const struct uECC_Curve_t * curve = NULL;

    switch(MBEDTLS_ECP_ID)
    {
        case MBEDTLS_ECP_DP_SECP192R1:
            curve = uECC_secp192r1();
            if (_key_len != 24)  goto fail;
            break;
        case MBEDTLS_ECP_DP_SECP224R1:
            curve = uECC_secp224r1();
            if (_key_len != 28)  goto fail;
            break;
        case MBEDTLS_ECP_DP_SECP256R1:
            curve = uECC_secp256r1();
            if (_key_len != 32)  goto fail;
            break;
        case MBEDTLS_ECP_DP_SECP256K1:
            curve = uECC_secp256k1();
            if (_key_len != 32)  goto fail;
            break;
        default:
            printf2(TAG_ERR, "error, invalid ECDSA alg specifier\n");
            exit(1);
    }

    if ( uECC_sign(_signing_key, data, len, sig, curve) == 0)
    {
        printf2(TAG_ERR, "error, uECC failed\n");
        exit(1);
    }
    return;

fail:
    printf2(TAG_ERR, "error, invalid key length\n");
    exit(1);

}

void generate_private_key(uint8_t * data, int len, uint8_t * data2, int len2, uint8_t * privkey, size_t * keylen)
{
    crypto_sha256_hmac_init(CRYPTO_MASTER_KEY, 0);
    crypto_sha256_hmac_update(data, len);
    crypto_sha256_hmac_update(data2, len2);
    crypto_sha256_hmac_update(master_secret, 32);    // TODO AES
    crypto_sha256_hmac_final(privkey, keylen);

    crypto_aes256_init(master_secret + 32, NULL, NRF_CRYPTO_ENCRYPT);
    crypto_aes256_op(privkey, keylen);
    crypto_aes256_uninit();
}


/*int uECC_compute_public_key(const uint8_t *private_key, uint8_t *public_key, uECC_Curve curve);*/
void crypto_ecc256_derive_public_key(uint8_t * data, int len, uint8_t * x, uint8_t * y)
{
    size_t privkeylen = 32;
    uint8_t privkey[32];
    uint8_t pubkey[64];

    generate_private_key(data,len,NULL,0,privkey,&privkeylen);

    memset(pubkey,0,sizeof(pubkey));
    uECC_compute_public_key(privkey, pubkey, _es256_curve);
    memmove(x,pubkey,32);
    memmove(y,pubkey+32,32);
}
void crypto_ecc256_compute_public_key(uint8_t * privkey, uint8_t * pubkey)
{
    uECC_compute_public_key(privkey, pubkey, _es256_curve);
}


void crypto_load_external_key(uint8_t * key, int len)
{
    _signing_key = key;
    _key_len = len;
}


void crypto_ecc256_make_key_pair(uint8_t * pubkey, uint8_t * privkey)
{
    if (uECC_make_key(pubkey, privkey, _es256_curve) != 1)
    {
        printf2(TAG_ERR, "Error, uECC_make_key failed\n");
        exit(1);
    }
}

void crypto_ecc256_shared_secret(const uint8_t * pubkey, const uint8_t * privkey, uint8_t * shared_secret)
{
    if (uECC_shared_secret(pubkey, privkey, shared_secret, _es256_curve) != 1)
    {
        printf2(TAG_ERR, "Error, uECC_shared_secret failed\n");
        exit(1);
    }

}


//struct AES_ctx aes_ctx;
void crypto_aes256_init(uint8_t * key, uint8_t * nonce, nrf_crypto_operation_t op)
{
    err_code = nrf_crypto_aes_init( &aes_ctx,
                                        &g_nrf_crypto_aes_cbc_256_info,
                                        op
                                        );
    APP_ERROR_CHECK(err_code);

    if (key == CRYPTO_TRANSPORT_KEY)
    {
        err_code = nrf_crypto_aes_key_set(&aes_ctx,
                                            transport_secret
                                            );
        APP_ERROR_CHECK(err_code);
        //AES_init_ctx(&aes_ctx, transport_secret);
    }
    else
    {
         err_code = nrf_crypto_aes_key_set(&aes_ctx,
                                            key
                                            );
        APP_ERROR_CHECK(err_code);
        //AES_init_ctx(&aes_ctx, key);
    }
    if (nonce == NULL)
    {
        err_code = nrf_crypto_aes_iv_set(&aes_ctx,
                                            NULLS
                                            );
        APP_ERROR_CHECK(err_code);
//        memset(aes_ctx.Iv, 0, 16);
    }
    else
    {
        err_code = nrf_crypto_aes_iv_set(&aes_ctx,
                                            nonce
                                            );
        APP_ERROR_CHECK(err_code);
        //memmove(aes_ctx.Iv, nonce, 16);
    }
}

// prevent round key recomputation
void crypto_aes256_reset_iv(uint8_t * nonce)
{
    if (nonce == NULL)
    {
        err_code = nrf_crypto_aes_iv_set(&aes_ctx,
                                            NULLS
                                            );
        APP_ERROR_CHECK(err_code);
//        memset(aes_ctx.Iv, 0, 16);
    }
    else
    {
        err_code = nrf_crypto_aes_iv_set(&aes_ctx,
                                            nonce
                                            );
        APP_ERROR_CHECK(err_code);
        //memmove(aes_ctx.Iv, nonce, 16);
    }
}

void crypto_aes256_op(uint8_t * buf, int length)
{
    err_code = nrf_crypto_aes_update(&aes_ctx,
                                     buf,
                                     length,
                                     buf
                                    );
    APP_ERROR_CHECK(err_code);

    err_code = nrf_crypto_aes_finalize( &aes_ctx,
                                        NULL,
                                        0,
                                        buf,
                                        length
                                        );

    APP_ERROR_CHECK(err_code);
}

//void crypto_aes256_decrypt(uint8_t * buf, int length)
//{
//    AES_CBC_decrypt_buffer(&aes_ctx, buf, length);
//}

//void crypto_aes256_encrypt(uint8_t * buf, int length)
//{
//    AES_CBC_encrypt_buffer(&aes_ctx, buf, length);
//}

void crypto_aes256_uninit(void)
{
    err_code = nrf_crypto_aes_uninit(&aes_ctx);
    APP_ERROR_CHECK(err_code);
}

#endif
